Revit 2027 API
BuiltInFailures.ViewFailures.InsertComponentViewFailure Property
 This type of Component cannot be placed in Elevation or Section view
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InsertComponentViewFailure { get; }
Public Shared ReadOnly Property InsertComponentViewFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InsertComponentViewFailure {
	FailureDefinitionId^ get ();
}
static member InsertComponentViewFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ViewFailures Class
Autodesk.Revit.DB Namespace